#include "global.h"

u8 D_xk1_80032CA0[] = "ファイルを選んで下さい";

u8 D_xk1_80032CB8[] = "をロードしますか？";

u8 D_xk1_80032CCC[] = "にセーブしますか？";

u8 D_xk1_80032CE0[] = "を消しますか？";

u8 D_xk1_80032CF0[] = "同じ名前のファイルがあるので、\nセーブできません";

u8 D_xk1_80032D20[] = "同じ名前のファイルがあるので、\n変更できません";

u8 D_xk1_80032D50[] = "これ以上セーブできません\nいらないファイルを消して下さい";

u8 D_xk1_80032D88[] = "エラーがあるのでセーブできません";

u8 D_xk1_80032DAC[] = "プロテクトがかかっています";

u8 D_xk1_80032DC8[] = "コースができていません";

u8 D_xk1_80032DE0[] = "ファイルが壊れています";

u8 D_xk1_80032DF8[] = "スタート地点を変更しました";

u8 D_xk1_80032E14[] = "別のディスクにコピーする場合は";

u8 D_xk1_80032E34[] = "ディスクを入れ替えて下さい";

u8 D_xk1_80032E50[] = "ＯＫ";

u8 D_xk1_80032E58[] = "コピーするファイルを選んで下さい";

u8 D_xk1_80032E7C[] = "新しいファイル名を入力して下さい";

u8 D_xk1_80032EA0[] = "この場所はシステム上変更できません";

u8 D_xk1_80032EC4[] = "コースデータをクリアします\nよろしいですか？";

u8 D_xk1_80032EF0[] = "点の間隔が狭くて置けません";

u8 D_xk1_80032F0C[] = "ダッシュマークが代りになくなります";

u8 D_xk1_80032F30[] = "ボタンでひとつ前の状態に戻れます";

u8 D_xk1_80032F54[] = "右下の　アイコンで\nヘルプを表\\示できます";

u8 D_xk1_80032F7C[] = "エントリーを解除します\nよろしいですか？";

u8 D_xk1_80032FA4[] = "最初はポイントをセットして，\nコースを作成して下さい";

u8 D_xk1_80032FD8[] = "Ａボタンでポイントをセットします\nセットする区間を変更する時は\nセットする区間にカーソ\\ルを合わ"
                      "せて\nＺトリガーです";

u8 D_xk1_80033048[] =
    "Ｚトリガーでポイントを選択します\nＺトリガーを押しながら複数の\nポイントを囲むと，複数のポイントを\n選択できます";

u8 D_xk1_800330B8[] = "Ａボタンで道路のタイプを変えます\nタイプを変える区間を変更する時は\n変更したい区間にカーソ\\ルを"
                      "合わせて\nＺトリガーです";

u8 D_xk1_8003312C[] = "Ａボタンでしかけをセットします\nセットする区間を変更する時は\nセットする区間にカーソ\\ルを合わせ"
                      "て\nＺトリガーです";

u8 D_xk1_8003319C[] = "コースが長すぎるので移動できません";

u8 D_xk1_800331C0[] = "ディスクを完全に初期化します\nよろしいですか？";

u8* D_xk1_800331F0[] = {
    D_xk1_80032CA0, D_xk1_80032CB8, D_xk1_80032CCC, D_xk1_80032CE0, D_xk1_80032CF0, D_xk1_80032D20, D_xk1_80032D50,
    D_xk1_80032D88, D_xk1_80032DAC, D_xk1_80032DC8, D_xk1_80032DE0, D_xk1_80032DF8, D_xk1_80032E14, D_xk1_80032E34,
    D_xk1_80032E50, D_xk1_80032E58, D_xk1_80032E7C, D_xk1_80032EA0, D_xk1_80032EC4, D_xk1_80032EF0, D_xk1_80032F0C,
    D_xk1_80032F30, D_xk1_80032F54, D_xk1_80032F7C, D_xk1_80032FA4, D_xk1_80032FD8, D_xk1_80033048, D_xk1_800330B8,
    D_xk1_8003312C, D_xk1_8003319C, D_xk1_800331C0,
};

u8 D_xk1_8003326C[] = "点の配置に無理があります";

u8 D_xk1_80033288[] = "コースが長すぎます";

u8 D_xk1_8003329C[] = "パーツの配置がおかしいです";

u8 D_xk1_800332B8[] = "道が重なっています";

u8 D_xk1_800332CC[] = "ジョイントパーツを置くには狭いです";

u8 D_xk1_800332F0[] = "これ以上おけません";

u8 D_xk1_80033304[] = "カーブにおける点の間隔が狭いです";

u8 D_xk1_80033328[] = "ダート等の置きすぎです";

u8 D_xk1_80033340[] = "コースが低すぎます";

u8 D_xk1_80033354[] = "コースがはみだしています";

u8 D_xk1_80033370[] = "表\\示処理が限界です";

u8 D_xk1_80033384[] = "コースが短かすぎます";

u8* D_xk1_8003339C[] = {
    D_xk1_8003326C, D_xk1_80033288, D_xk1_8003329C, D_xk1_800332B8, D_xk1_800332CC, D_xk1_800332F0,
    D_xk1_80033304, D_xk1_80033328, D_xk1_80033340, D_xk1_80033354, D_xk1_80033370, D_xk1_80033384,
};
